Tekla.Structures.Analysis.AnalysisPartLoadingProperties
The AnalysisPartLoadingProperties class contains information related to analysis part loading properties.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties._LoadGenerationSelfWeight
This indicates whether selfweight load is generated.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties._LoadGenerationGroupIdentifierFactors
The load generation group id factors.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties._LoadGenerationPartNamesInclude
This indicates whether part names are included in the load generation.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties._LoadGenerationPartNames
The load generation part names.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties._LoadGenerationAutoCreateFixedSupports
This indicates whether fixed supports are automatically created.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties.LoadGenerationSelfWeight
Indicates whether the selfweight load is generated.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties.LoadGenerationGroupIdentifierFactors
The load generation group identifier factors.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties.LoadGenerationAutoCreateFixedSupports
Indicates whether fixed supports are automatically created.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties.LoadGenerationPartNamesInclude
Indicates whether part names are included in the load generation.

Tekla.Structures.Analysis.AnalysisPartLoadingProperties.LoadGenerationPartNames
The load generation part names.